Foundation/v12/hsSphere_AMR_qtr/0.org/freestreamConditions
pInf            12100;
TInf            217;
UInf            (762 0 0);
gamma           1.4;
k               1000;
omega           1;