Foundation/v12/hsSphere_AMR_qtr/system/MachNo
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates the Mach Number field from the velocity field.

\*---------------------------------------------------------------------------*/

type            MachNo;
libs            ("libfieldFunctionObjects.so");

U               U;
field           $U;

executeControl  writeTime;
writeControl    writeTime;

// ************************************************************************* //
