Foundation/v12/hsSphere_AMR_qtr/system/forceCoeffsCompressible
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates lift, drag and moment coefficients by summing forces on
    specified patches for a case where the solver is compressible; i.e.,
    pressure has units of kg/m/s^2 (Pa).

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/functions/forces/forceCoeffs.cfg"

patches     (sphere); // Names of patches on which to calculate forces

magUInf     762;      // Far field velocity magnitude; e.g., 20 m/s
rhoInf      1.9484e-1;       // Far field density; e.g., 1.225 kg/m^3 for air
lRef        0.196;         // Reference length scale for moment calculations;
                            // e.g., 1 m
Aref        0.0301719;         // Reference area; e.g., 1 m^2

CofR        (0 0 0);         // Centre of rotation; e.g., (0 0 0)

liftDir     (0 0 1);      // Direction of lift force; e.g., (0 0 1)
dragDir     (1 0 0);      // Direction of drag force; e.g., (1 0 0)
pitchAxis   (0 1 0);    // Pitch axis; e.g., (0 1 0)

// ************************************************************************* //
