Foundation/v12/hsSphere_AMR_qtr/system/magGradP
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates the magnitude of a field.

\*---------------------------------------------------------------------------*/

type            mag;
libs            ("libfieldFunctionObjects.so");

field           gradP;
result          magGradP;

executeControl  timeStep;
executeInterval 1;
writeControl    writeTime;

// ************************************************************************* //
