Foundation/v12/hsSphere_AMR_qtr/system/writeCellVolumes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes the cell-volumes volScalarField.

\*---------------------------------------------------------------------------*/

type            writeCellVolumes;
libs            ("libfieldFunctionObjects.so");

executeControl  timeStep;
executeInterval 1;
writeControl    writeTime;

// ************************************************************************* //
